In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
pd.set_option("display.max_columns",None) # it is only for scroll bar purpose

In [98]:
df = pd.read_csv("D:\\PYTHON FULL STACK\\LibraryPrograms\\Pandas\\DATAFRAME\\STUDENTSMARKSANALYSIS\\student_marks.csv")
print(df)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social
0    100   Ramesh      50       60     66     99       66      55
1    101   Rajesh      45       34     67     56       78      78
2    102   Rossum      56       88     56     99       44      77
3    103     Raji      34       56     56     88       55      55
4    104   Kalyan      51       63     62     93       67      51
5    105  Karthik      39       68     68     63       65      48
6    106   Kambli      53       59     89     92       48      73
7    107  Praveen      55       88     94     86       48      45
8    108   Ganesh      55       74     86     95       48      35
9    109     Nags      53       77     44     77       86      47
10   110    Biswa      66       68     64     76       96      75
11   111   Ritchi      66       68     62     93       86      75
12   112   Kalyan      53       63     99     90       76      67
13   113  Shareef      66       88     99     87       76      68
14   114     Sonu      45       67     78     77       55      46
15   115   Rakesh      67       78     88     78       67      49

In [99]:


# 1.) Display Alternative students record/details
 #Step:1 Retrive all the columns names
df.columns

Index(['Htno', 'Name', 'Telugu', 'English', 'Hindi', 'Maths', 'Science',
       'Social'],
      dtype='object')

In [100]:
# only Even record
df[::2]

    Htno    Name  Telugu  English  Hindi  Maths  Science  Social
0    100  Ramesh      50       60     66     99       66      55
2    102  Rossum      56       88     56     99       44      77
4    104  Kalyan      51       63     62     93       67      51
6    106  Kambli      53       59     89     92       48      73
8    108  Ganesh      55       74     86     95       48      35
10   110   Biswa      66       68     64     76       96      75
12   112  Kalyan      53       63     99     90       76      67
14   114    Sonu      45       67     78     77       55      46

In [101]:
# only Odd record 
df[1::2]

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social
1    101   Rajesh      45       34     67     56       78      78
3    103     Raji      34       56     56     88       55      55
5    105  Karthik      39       68     68     63       65      48
7    107  Praveen      55       88     94     86       48      45
9    109     Nags      53       77     44     77       86      47
11   111   Ritchi      66       68     62     93       86      75
13   113  Shareef      66       88     99     87       76      68
15   115   Rakesh      67       78     88     78       67      49

In [102]:
# 2.) get the last five record 
df.columns

Index(['Htno', 'Name', 'Telugu', 'English', 'Hindi', 'Maths', 'Science',
       'Social'],
      dtype='object')

In [103]:
 #Step:2 Retriving the column that we have to work
df.tail()

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social
11   111   Ritchi      66       68     62     93       86      75
12   112   Kalyan      53       63     99     90       76      67
13   113  Shareef      66       88     99     87       76      68
14   114     Sonu      45       67     78     77       55      46
15   115   Rakesh      67       78     88     78       67      49

In [104]:
# find the Number of record in a dataset and also 
# find the number of columns ---------> shape[1] gives number of columns

#Step:1 Retrive all the columns names
df.columns

Index(['Htno', 'Name', 'Telugu', 'English', 'Hindi', 'Maths', 'Science',
       'Social'],
      dtype='object')

In [105]:
df.shape

(16, 8)

In [106]:

print("Number of Rows into the DataSet  =",df.shape[0])
print("Number of Column into the DataSet =",df.shape[1])

Number of Rows into the DataSet  = 16
Number of Column into the DataSet = 8

In [107]:
#3.get the information about number of column and 
# number of rows Datatype of Each column and Memory management 

#Step:1 Retrive all the columns names
df.columns

Index(['Htno', 'Name', 'Telugu', 'English', 'Hindi', 'Maths', 'Science',
       'Social'],
      dtype='object')

In [108]:
#Step:2 Retriving the column that we have to work
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Htno     16 non-null     int64
 1   Name     16 non-null     object
 2   Telugu   16 non-null     int64
 3   English  16 non-null     int64
 4   Hindi    16 non-null     int64
 5   Maths    16 non-null     int64
 6   Science  16 non-null     int64
 7   Social   16 non-null     int64
dtypes: int64(7), object(1)
memory usage: 1.1+ KB

In [109]:
# 4.) get the descriptive Statistics information on Non-numerical
#  column and numerical column ---> describe include ="all"

#Step:1 Retrive all the columns names
df.columns

Index(['Htno', 'Name', 'Telugu', 'English', 'Hindi', 'Maths', 'Science',
       'Social'],
      dtype='object')

In [110]:
#Step:2 Retriving the column that we have to work
df.describe(include="all")

,Htno,Name,Telugu,English,Hindi,Maths,Science,Social
count,16.000000,16,16.000000,16.000000,16.000000,16.000000,16.000000,16.00
unique,NaN,15,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Kalyan,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN
mean,107.500000,NaN,53.375000,68.687500,73.625000,84.312500,66.312500,59.00
std,4.760952,NaN,9.715109,13.917465,16.958282,12.338118,15.797547,14.00
min,100.000000,NaN,34.000000,34.000000,44.000000,56.000000,44.000000,35.00
25%,103.750000,NaN,48.750000,62.250000,62.000000,77.000000,53.250000,47.75
50%,107.500000,NaN,53.000000,68.000000,67.500000,87.500000,66.500000,55.00
75%,111.250000,NaN,58.500000,77.250000,88.250000,93.000000,76.500000,73.50
max,115.000000,NaN,67.000000,88.000000,99.000000,99.000000,96.000000,78.00

In [111]:
# 5.) before solving this Question calculate total marks percentage and grade 
#     and Create the three column total percentage and grade 
#     and find the distincent students marks 


#Step:1 Retrive all the columns names
df.columns

Index(['Htno', 'Name', 'Telugu', 'English', 'Hindi', 'Maths', 'Science',
       'Social'],
      dtype='object')

In [112]:
#Step:2 Retriving the column that we have to work
#! Adding the Total column  into  it
df["Total"] = df["Telugu"]+df["English"]+df["Hindi"]+df["Maths"]+df["Science"]+df["Social"]
print(df)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social  Total
0    100   Ramesh      50       60     66     99       66      55    396
1    101   Rajesh      45       34     67     56       78      78    358
2    102   Rossum      56       88     56     99       44      77    420
3    103     Raji      34       56     56     88       55      55    344
4    104   Kalyan      51       63     62     93       67      51    387
5    105  Karthik      39       68     68     63       65      48    351
6    106   Kambli      53       59     89     92       48      73    414
7    107  Praveen      55       88     94     86       48      45    416
8    108   Ganesh      55       74     86     95       48      35    393
9    109     Nags      53       77     44     77       86      47    384
10   110    Biswa      66       68     64     76       96      75    445
11   111   Ritchi      66       68     62     93       86      75    450
12   112   Kalyan      53       63     99     90       76      67    448
13   113  Shareef      66       88     99     87       76      68    484
14   114     Sonu      45       67     78     77       55      46    368
15   115   Rakesh      67       78     88     78       67      49    427

In [113]:
#! Adding the percentage column into it
df["percentage"] = df["percentage"] = df["Total"]/600*100
print(round(df),2)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social  Total  \
0    100   Ramesh      50       60     66     99       66      55    396
1    101   Rajesh      45       34     67     56       78      78    358
2    102   Rossum      56       88     56     99       44      77    420
3    103     Raji      34       56     56     88       55      55    344
4    104   Kalyan      51       63     62     93       67      51    387
5    105  Karthik      39       68     68     63       65      48    351
6    106   Kambli      53       59     89     92       48      73    414
7    107  Praveen      55       88     94     86       48      45    416
8    108   Ganesh      55       74     86     95       48      35    393
9    109     Nags      53       77     44     77       86      47    384
10   110    Biswa      66       68     64     76       96      75    445
11   111   Ritchi      66       68     62     93       86      75    450
12   112   Kalyan      53       63     99     90       76      67    448
13   113  Shareef      66       88     99     87       76      68    484
14   114     Sonu      45       67     78     77       55      46    368
15   115   Rakesh      67       78     88     78       67      49    427

    percentage
0         66.0
1         60.0
2         70.0
3         57.0
4         64.0
5         58.0
6         69.0
7         69.0
8         66.0
9         64.0
10        74.0
11        75.0
12        75.0
13        81.0
14        61.0
15        71.0   2

In [140]:
# Adding the Grade column into it
#* df.loc["Simple test condition",["colname"]]
df.loc[df["percentage"]>=75,["Grade"]]="DISTINCTION"
print(df)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social  Total  \
0    100   Ramesh      50       60     66     99       66      55    396
1    101   Rajesh      45       34     67     56       78      78    358
2    102   Rossum      56       88     56     99       44      77    420
3    103     Raji      34       56     56     88       55      55    344
4    104   Kalyan      51       63     62     93       67      51    387
5    105  Karthik      39       68     68     63       65      48    351
6    106   Kambli      53       59     89     92       48      73    414
7    107  Praveen      55       88     94     86       48      45    416
8    108   Ganesh      55       74     86     95       48      35    393
9    109     Nags      53       77     44     77       86      47    384
10   110    Biswa      66       68     64     76       96      75    445
11   111   Ritchi      66       68     62     93       86      75    450
12   112   Kalyan      53       63     99     90       76      67    448
13   113  Shareef      66       88     99     87       76      68    484
14   114     Sonu      45       67     78     77       55      46    368
15   115   Rakesh      67       78     88     78       67      49    427

    percentage        Grade
0    66.000000        FIRST
1    59.666667        THIRD
2    70.000000        FIRST
3    57.333333        THIRD
4    64.500000       SECOND
5    58.500000        THIRD
6    69.000000        FIRST
7    69.333333        FIRST
8    65.500000        FIRST
9    64.000000       SECOND
10   74.166667          NaN
11   75.000000  DISTINCTION
12   74.666667          NaN
13   80.666667  DISTINCTION
14   61.333333       SECOND
15   71.166667        FIRST

In [141]:
df.loc[((df["percentage"]>=65) & (df["percentage"]<74)),["Grade"]]="FIRST"
print(df)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social  Total  \
0    100   Ramesh      50       60     66     99       66      55    396
1    101   Rajesh      45       34     67     56       78      78    358
2    102   Rossum      56       88     56     99       44      77    420
3    103     Raji      34       56     56     88       55      55    344
4    104   Kalyan      51       63     62     93       67      51    387
5    105  Karthik      39       68     68     63       65      48    351
6    106   Kambli      53       59     89     92       48      73    414
7    107  Praveen      55       88     94     86       48      45    416
8    108   Ganesh      55       74     86     95       48      35    393
9    109     Nags      53       77     44     77       86      47    384
10   110    Biswa      66       68     64     76       96      75    445
11   111   Ritchi      66       68     62     93       86      75    450
12   112   Kalyan      53       63     99     90       76      67    448
13   113  Shareef      66       88     99     87       76      68    484
14   114     Sonu      45       67     78     77       55      46    368
15   115   Rakesh      67       78     88     78       67      49    427

    percentage        Grade
0    66.000000        FIRST
1    59.666667        THIRD
2    70.000000        FIRST
3    57.333333        THIRD
4    64.500000       SECOND
5    58.500000        THIRD
6    69.000000        FIRST
7    69.333333        FIRST
8    65.500000        FIRST
9    64.000000       SECOND
10   74.166667          NaN
11   75.000000  DISTINCTION
12   74.666667          NaN
13   80.666667  DISTINCTION
14   61.333333       SECOND
15   71.166667        FIRST

In [ ]:

#
# df.loc[((df["percentage"]>=60) & (df["percentage"]<65)),["Grade"]]="SECOND"

df.loc[((df["percentage"]>=60) & (df["percentage"]<65)),["Grade"]]="SECOND"
print(df)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social  Total  \
0    100   Ramesh      50       60     66     99       66      55    396
1    101   Rajesh      45       34     67     56       78      78    358
2    102   Rossum      56       88     56     99       44      77    420
3    103     Raji      34       56     56     88       55      55    344
4    104   Kalyan      51       63     62     93       67      51    387
5    105  Karthik      39       68     68     63       65      48    351
6    106   Kambli      53       59     89     92       48      73    414
7    107  Praveen      55       88     94     86       48      45    416
8    108   Ganesh      55       74     86     95       48      35    393
9    109     Nags      53       77     44     77       86      47    384
10   110    Biswa      66       68     64     76       96      75    445
11   111   Ritchi      66       68     62     93       86      75    450
12   112   Kalyan      53       63     99     90       76      67    448
13   113  Shareef      66       88     99     87       76      68    484
14   114     Sonu      45       67     78     77       55      46    368
15   115   Rakesh      67       78     88     78       67      49    427

    percentage        Grade
0    66.000000        FIRST
1    59.666667          NaN
2    70.000000        FIRST
3    57.333333          NaN
4    64.500000       SECOND
5    58.500000          NaN
6    69.000000        FIRST
7    69.333333        FIRST
8    65.500000        FIRST
9    64.000000       SECOND
10   74.166667          NaN
11   75.000000          NaN
12   74.666667          NaN
13   80.666667  DISTINCTION
14   61.333333       SECOND
15   71.166667        FIRST

In [139]:
df.loc[(df["percentage"]<60),["Grade"]]="THIRD"
print(df)

# df.loc[(df["percent"]<60),["grade"]]="THIRD"
# print(df)

    Htno     Name  Telugu  English  Hindi  Maths  Science  Social  Total  \
0    100   Ramesh      50       60     66     99       66      55    396
1    101   Rajesh      45       34     67     56       78      78    358
2    102   Rossum      56       88     56     99       44      77    420
3    103     Raji      34       56     56     88       55      55    344
4    104   Kalyan      51       63     62     93       67      51    387
5    105  Karthik      39       68     68     63       65      48    351
6    106   Kambli      53       59     89     92       48      73    414
7    107  Praveen      55       88     94     86       48      45    416
8    108   Ganesh      55       74     86     95       48      35    393
9    109     Nags      53       77     44     77       86      47    384
10   110    Biswa      66       68     64     76       96      75    445
11   111   Ritchi      66       68     62     93       86      75    450
12   112   Kalyan      53       63     99     90       76      67    448
13   113  Shareef      66       88     99     87       76      68    484
14   114     Sonu      45       67     78     77       55      46    368
15   115   Rakesh      67       78     88     78       67      49    427

    percentage        Grade
0    66.000000        FIRST
1    59.666667        THIRD
2    70.000000        FIRST
3    57.333333        THIRD
4    64.500000       SECOND
5    58.500000        THIRD
6    69.000000        FIRST
7    69.333333        FIRST
8    65.500000        FIRST
9    64.000000       SECOND
10   74.166667          NaN
11   75.000000          NaN
12   74.666667          NaN
13   80.666667  DISTINCTION
14   61.333333       SECOND
15   71.166667        FIRST